backend/app/Controllers/Api/AdminClientsController.php

SELECT COUNT(*) as total
FROM `clientes` `c`
LEFT JOIN `usuarios` `u` ON `u`.`id` = `c`.`usuario_id`
SELECT `c`.`id`, `c`.`dni`, `c`.`nombre`, `c`.`fecha_registro`, `c`.`estado`, `c`.`fecha_asignacion`, `u`.`id` as `agente_id`, `u`.`nombres` as `agente_nombres`, `u`.`ventanilla` as `agente_ventanilla`
FROM `clientes` `c`
LEFT JOIN `usuarios` `u` ON `u`.`id` = `c`.`usuario_id`
ORDER BY `c`.`fecha_registro` ASC, `c`.`id` ASC
 LIMIT 50
---
    public function index()
    {
        $perPage = max(1, min(100, (int) ($this->request->getGet('perPage') ?? 20)));
        $page = max(1, (int) ($this->request->getGet('page') ?? 1));

        $dni = trim((string) ($this->request->getGet('dni') ?? ''));
        $nombre = trim((string) ($this->request->getGet('nombre') ?? ''));
        $estado = trim((string) ($this->request->getGet('estado') ?? ''));

        $db = Database::connect();
        $base = $db->table('clientes c')
            ->join('usuarios u', 'u.id = c.usuario_id', 'left');

        if ($dni !== '') {
            $base->like('c.dni', $dni);
        }
        if ($nombre !== '') {
            $base->like('c.nombre', $nombre);
        }
        if ($estado !== '') {
            $base->where('c.estado', $estado);
        }

        $countRow = (clone $base)->select('COUNT(*) as total', false)->get()->getRowArray();
        $total = (int) ($countRow['total'] ?? 0);

        $result = (clone $base)
            ->select([
                'c.id',
                'c.dni',
                'c.nombre',
                'c.fecha_registro',
                'c.estado',
                'c.fecha_asignacion',
                'u.id as agente_id',
                'u.nombres as agente_nombres',
                'u.ventanilla as agente_ventanilla',
            ])
            ->orderBy('c.fecha_registro', 'ASC')
            ->orderBy('c.id', 'ASC')
            ->get($perPage, ($page - 1) * $perPage)
            ->getResultArray();