backend/app/Controllers/Api/PublicTurnosController.php

    public function index()
    {
        $db = Database::connect();

        $pendientes = $db->table('clientes')
            ->select([
                'clientes.id',
                'clientes.id as turno',
                'clientes.dni',
                'clientes.nombre',
                'clientes.estado',
                'clientes.fecha_registro',
                'clientes.fecha_asignacion',
                'usuarios.ventanilla as ventanilla',
                'usuarios.nombres as agente',
            ])
            ->join('usuarios', 'usuarios.id = clientes.usuario_id', 'left')
            ->whereIn('clientes.estado', ['Nuevo', 'Asignado'])
            ->orderBy("FIELD(clientes.estado,'Asignado','Nuevo')", '', false)
            ->orderBy('clientes.fecha_registro', 'ASC')
            ->orderBy('clientes.id', 'ASC')
            ->get()
            ->getResultArray();

        $history = $db->table('clientes')
            ->select([
                'clientes.id',
                'clientes.id as turno',
                'clientes.dni',
                'clientes.nombre',
                'clientes.estado',
                'clientes.fecha_registro',
                'clientes.fecha_asignacion',
                'usuarios.ventanilla as ventanilla',
                'usuarios.nombres as agente',
            ])
            ->join('usuarios', 'usuarios.id = clientes.usuario_id', 'left')
            ->whereIn('clientes.estado', ['Atendido', 'No Atendido'])
            ->orderBy('clientes.id', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();
---
SELECT `clientes`.`id`, `clientes`.`id` as `turno`, `clientes`.`dni`, `clientes`.`nombre`, `clientes`.`estado`, `clientes`.`fecha_registro`, `clientes`.`fecha_asignacion`, `usuarios`.`ventanilla` as `ventanilla`, `usuarios`.`nombres` as `agente`
FROM `clientes`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `clientes`.`usuario_id`
WHERE `clientes`.`estado` IN ('Nuevo','Asignado')
ORDER BY FIELD(clientes.estado,'Asignado','Nuevo'), `clientes`.`fecha_registro` ASC, `clientes`.`id` ASC
SELECT `clientes`.`id`, `clientes`.`id` as `turno`, `clientes`.`dni`, `clientes`.`nombre`, `clientes`.`estado`, `clientes`.`fecha_registro`, `clientes`.`fecha_asignacion`, `usuarios`.`ventanilla` as `ventanilla`, `usuarios`.`nombres` as `agente`
FROM `clientes`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `clientes`.`usuario_id`
WHERE `clientes`.`estado` IN ('Atendido','No Atendido')
ORDER BY `clientes`.`id` DESC
 LIMIT 10